# REFERENCES:
#
# - https://pumpingco.de/blog/brewfile
# - https://medium.com/@satorusasozaki/automate-mac-os-x-configuration-by-using-brewfile-58a78ce5cc53

# taps
tap 'homebrew/bundle'
tap 'homebrew/cask' || true
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/services'

# formulae
brew 'curl'
brew 'docker-compose'
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'gpg2'
brew 'jq'
brew 'lego'
brew 'mongosh'
brew 'nvm'
brew 'pinentry-mac'
brew 'python'
brew 'terminal-notifier'
brew 'yarn'
brew 'zsh'

# casks
cask 'docker'
cask 'google-cloud-sdk'
